using System;
using System.Collections.Generic;
using System.Collections;
public class SOATO
{
    static Dictionary<string, string> codes = new Dictionary<string, string>
    {
        //Брестская область
        { "Барановичский", "1204000000" },
        { "Берёзовский" , "1208000000" },
        { "Брестский" , "1212000000" },
        { "Ганцевичский" , "1216000000" },
        { "Дрогичинский" , "1220000000" },
        { "Жабинковский" , "1225000000" },
        { "Ивановский" , "1230000000" },
        { "Ивацевичский" , "1234000000" },
        { "Каменецкий" , "1240000000" },
        { "Кобринский" , "1243000000" },
        { "Лунинецкий" , "1247000000" },
        { "Ляховичский" , "1250000000" },
        { "Малоритский" , "1252000000" },
        { "Пинский" , "1254000000" },
        { "Пружанский" , "1256000000" },
        { "Столинский" , "1258000000" },
        { "г. Брест" , "1401000000" },
        { "Ленинский район г. Бреста" , "1401365000" },
        { "Московский район г. Бреста" , "1401368000" },
        { "г. Барановичи" , "1410000000" },
        { "г. Пинск" , "1445000000" },

        //Витебская область
        { "Бешенковичский", "2205000000" },
        { "Браславский", "2208000000" },
        { "Верхнедвинский", "2210000000" },
        { "Витебский", "2212000000" },
        { "Глубокский", "2215000000" },
        { "Городокский", "2218000000" },
        { "Докшицкий", "2221000000" },
        { "Дубровенский", "2224000000" },
        { "Лепельский", "2227000000" },
        { "Лиозненский", "2230000000" },
        { "Миорский", "2233000000" },
        { "Оршанский", "2236000000" },
        { "Полоцкий", "2238000000" },
        { "Поставский", "2240000000" },
        { "Россонский", "2242000000" },
        { "Сенненский", "2244000000" },
        { "Толочинский", "2246000000" },
        { "Ушачский", "2249000000" },
        { "Чашникский", "2251000000" },
        { "Шарковщинский", "2255000000" },
        { "Шумилинский", "2258000000" },
        { "г. Витебск", "2401000000" },
        { "Железнодорожный район г. Витебска", "2401365000" },
        { "Октябрьский район г. Витебска", "2401372000" },
        { "Первомайский район г. Витебска", "2401383000" },
        { "г. Новополоцк", "2418000000" },

        //Гомельская область
        { "Брагинский", "3203000000" },
        { "Буда-Кошелевский", "3205000000" },
        { "Ветковский", "3208000000" },
        { "Гомельский", "3210000000" },
        { "Добрушский", "3212000000" },
        { "Ельский", "3214000000" },
        { "Житковичский", "3216000000" },
        { "Жлобинский", "3218000000" },
        { "Калинковичский", "3223000000" },
        { "Кормянский", "3225000000" },
        { "Лельчицкий", "3228000000" },
        { "Лоевский", "3230000000" },
        { "Мозырский", "3235000000" },
        { "Наровлянский", "3238000000" },
        { "Октябрьский", "3240000000" },
        { "Петриковский", "3243000000" },
        { "Речицкий", "3245000000" },
        { "Рогачёвский", "3247000000" },
        { "Светлогорский", "3250000000" },
        { "Хойникский", "3254000000" },
        { "Чечерский", "3256000000" },
        { "г. Гомель", "3401000000" },
        { "Железнодорожный район г. Гомеля", "3401365000" },
        { "Новобелицкий район г. Гомеля", "3401370000" },
        { "Советский район г. Гомеля", "3401375000" },
        { "Центральный район г. Гомеля", "3401383000" },  

        //Гродненская область
        { "Берестовицкий", "4204000000" },
        { "Волковысский", "4208000000" },
        { "Вороновский", "4213000000" },
        { "Гродненский", "4220000000" },
        { "Дятловский", "4223000000" },
        { "Зельвенский", "4226000000" },
        { "Ивьевский", "4229000000" },
        { "Кореличский", "4233000000" },
        { "Лидский", "4236000000" },
        { "Мостовский", "4240000000" },
        { "Новогрудский", "4243000000" },
        { "Островецкий", "4246000000" },
        { "Ошмянский", "4249000000" },
        { "Свислочский", "4252000000" },
        { "Слонимский", "4254000000" },
        { "Сморгонский", "4256000000" },
        { "Щучинский", "4258000000" },
        { "г. Гродно", "4401000000" },
        { "Ленинский район г. Гродно", "4401365000" },
        { "Октябрьский район г. Гродно", "4401369000" },
        { "г. Минск", "5000000000" },
        { "Заводской район г. Минска", "5264000000" },
        { "Ленинский район г. Минска", "5268000000" },
        { "Московский район г. Минска", "5270000000" },
        { "Октябрьский район г. Минска", "5272000000" },
        { "Партизанский район г. Минска", "5274000000" },
        { "Первомайский район г. Минск", "5276000000" },
        { "Советский район г. Минска", "5280000000" },
        { "Фрунзенский район г. Минска", "5284000000" },
        { "Центральный район г. Минска", "5290000000" },  

        //Минская область
        { "Березинский", "6204000000" },
        { "Борисовский", "6208000000" },
        { "Вилейский", "6213000000" },
        { "Воложинский", "6220000000" },
        { "Дзержинский", "6222000000" },
        { "Клецкий", "6225000000" },
        { "Копыльский", "6228000000" },
        { "Крупский", "6230000000" },
        { "Логойский", "6232000000" },
        { "Любанский", "6234000000" },
        { "Минский", "6236000000" },
        { "Молодечненский", "6238000000" },
        { "Мядельский", "6240000000" },
        { "Несвижский", "6242000000" },
        { "Пуховичский", "6244000000" },
        { "Слуцкий", "6246000000" },
        { "Смолевичский", "6248000000" },
        { "Солигорский", "6250000000" },
        { "Стародорожский", "6252000000" },
        { "Столбцовский", "6254000000" },
        { "Узденский", "6256000000" },
        { "Червенский", "6258000000" },
        { "г. Жодино", "6413000000" },

        //Могилевская область
        { "Белыничский" , "7204000000" },
        { "Бобруйский" , "7208000000" },
        { "Быховский" , "7213000000" },
        { "Глусский" , "7217000000" },
        { "Горецкий" , "7220000000" },
        { "Дрибинский" , "7223000000" },
        { "Кировский" , "7225000000" },
        { "Климовичский" , "7228000000" },
        { "Кличевский" , "7230000000" },
        { "Костюковичский" , "7235000000" },
        { "Краснопольский" , "7238000000" },
        { "Кричевский" , "7240000000" },
        { "Круглянский" , "7242000000" },
        { "Могилевский" , "7244000000" },
        { "Мстиславский" , "7246000000" },
        { "Осиповичский" , "7248000000" },
        { "Славгородский" , "7250000000" },
        { "Хотимский" , "7252000000" },
        { "Чаусский" , "7254000000" },
        { "Чериковский" , "7256000000" },
        { "Шкловский" , "7258000000" },
        { "г. Могилев" , "7401000000" },
        { "Ленинский район г. Могилева" , "7401367000" },
        { "Октябрьский район г. Могилева" , "7401372000" },
        { "г. Бобруйск" , "7410000000" },
        { "Ленинский район г. Бобруйска" , "7410368000" },
        { "Первомайский район г. Бобруйска" , "7410373000" },

     };

    public static string getSOATO(string reg)
    {
        string str = "";
        string ch = " ";
        int indexOf = reg.IndexOf(ch);
        try
        {
            foreach (var cod in codes)
            {
                if (cod.Key == reg) { str = cod.Value; }
            }
            if (str == "")
            {
                var reg4 = reg.Substring(indexOf + 1, 4);
                foreach (var cod in codes)
                {
                    if (cod.Key.IndexOf(reg4) != -1) { str = cod.Value; }
                }
            }
            if (str == "")
            {
                var reg3 = reg.Substring(indexOf + 1, 3);
                foreach (var cod in codes)
                {
                    if (cod.Key.IndexOf(reg3) != -1) { str = cod.Value; }
                }
            }
        }
        catch { str = ""; }
        return str;
    }
}
